#+title: Org Babel Notes

* Org Babel Sample


Execution: ~C-c C-c~ or ~org-babel-execute-src-block~

https://orgmode.org/worg/org-contirb/babel

#+begin_src python :results output

  def greeting():
      print("Hello!")

  greeting()

#+end_src

#+RESULTS:
: Hello!

To set up babel languages

#+begin_src emacs-lisp

  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t)
     (python . t)))

  (setq org-confirm-babel-evaluate nil) ;; Disables confirmation before evaluating code

#+end_src

** adkaljfdla

- list 1
- list 2
- list 3


*** alsjfdladfj

**** kadjlfjafld
